app/views/tweets/index.html.haml

                    .num
                      = link_to current_user.tweets.count, user_path(current_user)
                  .col-xs-4.follow-num
                    .text
---
SELECT "tweets".* FROM "tweets"  ORDER BY "tweets"."created_at" DESC
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]