app/views/users/show.html.haml

SELECT  1 AS one FROM "tweets" WHERE "tweets"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  ORDER BY "tweets"."created_at" DESC  [["user_id", 1]]
---
  .list-group
    - if @user.tweets.empty?
      .list-group-item