app/controllers/favorites_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ?  ORDER BY "tweets"."created_at" DESC LIMIT 1  [["id", 3]]
INSERT INTO "favorites" ("tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 3], ["user_id", 1], ["created_at", "2016-07-04 07:04:01.661189"], ["updated_at", "2016-07-04 07:04:01.661189"]]
---
  def create
    @tweet    = Tweet.find(params[:tweet_id])
    @favorite = current_user.favorites.build(tweet: @tweet)

    if @favorite.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."tweet_id" = ? LIMIT 1  [["user_id", 1], ["tweet_id", 3]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
    @favorite = current_user.favorites.find_by!(tweet_id: params[:tweet_id])
    @favorite.destroy