app/controllers/registrations_controller.rb

  def create
    @user = User.new(params_user)

    if @user.save
---
INSERT INTO "users" ("name", "email", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)