app/controllers/settings_controller.rb

  def update
    @user = current_user
    if @user.update_attributes(params_user)
---
UPDATE "users" SET "screen_name" = ?, "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["screen_name", "モアイ"], ["bio", "修正しました。"], ["updated_at", "2016-06-20 09:18:40.856513"], ["id", 1]]