app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"  ORDER BY "tweets"."created_at" DESC

  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user = current_user

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "初投稿！"], ["user_id", 1], ["created_at", "2016-07-04 03:04:11.262320"], ["updated_at", "2016-07-04 03:04:11.262320"]]